-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Servidor: 127.0.0.1
-- Tiempo de generación: 28-05-2026 a las 13:56:47
-- Versión del servidor: 10.4.11-MariaDB
-- Versión de PHP: 7.4.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de datos: `db_holy_songs`
--

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `songs_versions`
--

CREATE TABLE `songs_versions` (
  `id_version` int(11) NOT NULL,
  `id_song` int(11) NOT NULL,
  `id_user` int(11) DEFAULT NULL,
  `action` enum('created','updated','deleted','restored') COLLATE utf8mb4_unicode_ci NOT NULL,
  `changes_json` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`changes_json`)),
  `song_data` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL CHECK (json_valid(`song_data`)),
  `created_at` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Volcado de datos para la tabla `songs_versions`
--

INSERT INTO `songs_versions` (`id_version`, `id_song`, `id_user`, `action`, `changes_json`, `song_data`, `created_at`) VALUES
(1, 8078, 3, 'updated', '{\"title\":{\"old\":\"5.Oтeць Мiй, я oбoжнюю Teбe - (font Arial)--------30px---\",\"new\":\"6.Oтeць Мiй, я oбoжнюю Teбe - (font Arial)--------30px---\"}}', '{\"title\":\"6.Oтeць Мiй, я oбoжнюю Teбe - (font Arial)--------30px---\",\"title2\":\"Tи є мiй cвiт, Tи є мiй Бoг\",\"title_note\":\"test\",\"song_text\":\"Інтро:  \\n|Em7  |C2  |G  |D\\/F#  |\\n\\n\\n\\n1 куплет:  \\n  Em7                   C2\\nОтець Мій, я обожнюю Тебе \\n                  G         D\\/F# \\nПонад усе у світі, бажаю Тебе\\n  Em7                         C2\\nІсусе мій, Спаситель любий, все, що маю, \\n            G                  D\\/F#\\nЯ віддам Тобі, віддам Тобі я все.\\n\\n\\n\\nЗаспів:  \\n    Am7  C2         Dsus4 D \\nВсі ангели Тебе підносять.\\n  Am7     C2        Dsus4 D \\nІ ми вклоняємось Тобі.\\n\\n\\n\\n\\nПриспів:  \\n           G             D \\nТи є мій світ, Ти є мій Бог,\\n        C           D \\nІ я віддам життя Тобі.\\n          G          D \\nГосподар мій, моя любов,\\n          C           D (Cm)\\nВ серці моєму тільки Ти.\\n\\n\\n\\nПрограш:  \\n|Em7  |C2  |G  |D\\/F#  |\\n\\n\\n\\n2 куплет: \\n    Em7                    C2\\nІ все, що маю, я віддам Тобі, Господь мій,\\n           G            D\\/F# \\nБо для Тебе живу кожен день.\\n      Em7                       C2\\nВсі дні мої - дарунок Твій, як жити кожну мить\\n         G            D\\/F#\\nНавчи мене, молю я Тебе.\",\"notes\":\"zzz\\n\\nЗаспів test:  \\n    Am7  C2         Dsus4 D \\nВсі ангели Тебе підносять.\\n  Am7     C2        Dsus4 D \\nІ ми вклоняємось Тобі.\"}', '2026-05-27 15:23:34'),
(2, 8078, 3, 'updated', '{\"title\":{\"old\":\"6.Oтeць Мiй, я oбoжнюю Teбe - (font Arial)--------30px---\",\"new\":\"zzz6.Oтeць Мiй, я oбoжнюю Teбe - (font Arial)--------30px---\"}}', '{\"title\":\"zzz6.Oтeць Мiй, я oбoжнюю Teбe - (font Arial)--------30px---\",\"title2\":\"Tи є мiй cвiт, Tи є мiй Бoг\",\"title_note\":\"test\",\"song_text\":\"Інтро:  \\n|Em7  |C2  |G  |D\\/F#  |\\n\\n\\n\\n1 куплет:  \\n  Em7                   C2\\nОтець Мій, я обожнюю Тебе \\n                  G         D\\/F# \\nПонад усе у світі, бажаю Тебе\\n  Em7                         C2\\nІсусе мій, Спаситель любий, все, що маю, \\n            G                  D\\/F#\\nЯ віддам Тобі, віддам Тобі я все.\\n\\n\\n\\nЗаспів:  \\n    Am7  C2         Dsus4 D \\nВсі ангели Тебе підносять.\\n  Am7     C2        Dsus4 D \\nІ ми вклоняємось Тобі.\\n\\n\\n\\n\\nПриспів:  \\n           G             D \\nТи є мій світ, Ти є мій Бог,\\n        C           D \\nІ я віддам життя Тобі.\\n          G          D \\nГосподар мій, моя любов,\\n          C           D (Cm)\\nВ серці моєму тільки Ти.\\n\\n\\n\\nПрограш:  \\n|Em7  |C2  |G  |D\\/F#  |\\n\\n\\n\\n2 куплет: \\n    Em7                    C2\\nІ все, що маю, я віддам Тобі, Господь мій,\\n           G            D\\/F# \\nБо для Тебе живу кожен день.\\n      Em7                       C2\\nВсі дні мої - дарунок Твій, як жити кожну мить\\n         G            D\\/F#\\nНавчи мене, молю я Тебе.\",\"notes\":\"zzz\\n\\nЗаспів test:  \\n    Am7  C2         Dsus4 D \\nВсі ангели Тебе підносять.\\n  Am7     C2        Dsus4 D \\nІ ми вклоняємось Тобі.\"}', '2026-05-27 15:58:06'),
(3, 8078, 3, 'updated', '{\"title\":{\"old\":\"zzz6.Oтeць Мiй, я oбoжнюю Teбe - (font Arial)--------30px---\",\"new\":\"6.Oтeць Мiй, я oбoжнюю Teбe - (font Arial)--------30px---\"}}', '{\"title\":\"6.Oтeць Мiй, я oбoжнюю Teбe - (font Arial)--------30px---\",\"title2\":\"Tи є мiй cвiт, Tи є мiй Бoг\",\"title_note\":\"test\",\"song_text\":\"Інтро:  \\n|Em7  |C2  |G  |D\\/F#  |\\n\\n\\n\\n1 куплет:  \\n  Em7                   C2\\nОтець Мій, я обожнюю Тебе \\n                  G         D\\/F# \\nПонад усе у світі, бажаю Тебе\\n  Em7                         C2\\nІсусе мій, Спаситель любий, все, що маю, \\n            G                  D\\/F#\\nЯ віддам Тобі, віддам Тобі я все.\\n\\n\\n\\nЗаспів:  \\n    Am7  C2         Dsus4 D \\nВсі ангели Тебе підносять.\\n  Am7     C2        Dsus4 D \\nІ ми вклоняємось Тобі.\\n\\n\\n\\n\\nПриспів:  \\n           G             D \\nТи є мій світ, Ти є мій Бог,\\n        C           D \\nІ я віддам життя Тобі.\\n          G          D \\nГосподар мій, моя любов,\\n          C           D (Cm)\\nВ серці моєму тільки Ти.\\n\\n\\n\\nПрограш:  \\n|Em7  |C2  |G  |D\\/F#  |\\n\\n\\n\\n2 куплет: \\n    Em7                    C2\\nІ все, що маю, я віддам Тобі, Господь мій,\\n           G            D\\/F# \\nБо для Тебе живу кожен день.\\n      Em7                       C2\\nВсі дні мої - дарунок Твій, як жити кожну мить\\n         G            D\\/F#\\nНавчи мене, молю я Тебе.\",\"notes\":\"zzz\\n\\nЗаспів test:  \\n    Am7  C2         Dsus4 D \\nВсі ангели Тебе підносять.\\n  Am7     C2        Dsus4 D \\nІ ми вклоняємось Тобі.\"}', '2026-05-27 16:00:18'),
(4, 8062, 82, 'updated', '{\"song_text\":{\"old\":\"r\",\"new\":\"1 куплет:  \\n  Em7                   C2\\nОтець Мій, я обожнюю Тебе \\n                  G         D\\/F# \\nПонад усе у світі, бажаю Тебе\\n  Em7                         C2\\nІсусе мій, Спаситель любий, все, що маю, \\n            G                  D\\/F#\\nЯ віддам Тобі, віддам Тобі я все.\"}}', '{\"title\":\"dfhafdh zzz\",\"title2\":\"\",\"title_note\":\"\",\"song_text\":\"1 куплет:  \\n  Em7                   C2\\nОтець Мій, я обожнюю Тебе \\n                  G         D\\/F# \\nПонад усе у світі, бажаю Тебе\\n  Em7                         C2\\nІсусе мій, Спаситель любий, все, що маю, \\n            G                  D\\/F#\\nЯ віддам Тобі, віддам Тобі я все.\",\"notes\":\"\"}', '2026-05-27 23:15:08'),
(5, 8062, 82, 'updated', '{\"title\":{\"old\":\"dfhafdh zzz\",\"new\":\"dfhafdh zzz 1verse\"}}', '{\"title\":\"dfhafdh zzz 1verse\",\"title2\":\"\",\"title_note\":\"\",\"song_text\":\"1 куплет:  \\n  Em7                   C2\\nОтець Мій, я обожнюю Тебе \\n                  G         D\\/F# \\nПонад усе у світі, бажаю Тебе\\n  Em7                         C2\\nІсусе мій, Спаситель любий, все, що маю, \\n            G                  D\\/F#\\nЯ віддам Тобі, віддам Тобі я все.\",\"notes\":\"\"}', '2026-05-27 23:15:26'),
(6, 8099, 82, 'updated', '{\"song_text\":{\"old\":\"Куплет 1.1:      \\n   Gm                    Cm\\nНехай поклоняться Тобі всі народи, Бог мій, \\n   Eb                        Bb         F\\nБо Ти Один достойний слави, Ти Один Святий!\\n   Gm                       Cm\\nНехай співають всі Тобі: \\\"Слава, слава, слава, \\n   Eb                  Bb    F\\nСлава, слава, слава Тобі!\\\"\\n\\n\\nКуплет 1.2:\\n   Gm                       Cm\\nНехай молитви всі Тобі з подякою складають,\\n    Eb                       Bb            F\\nБо Ти Один достойний слави, добрий тільки Ти!\\n   Gm                       Cm\\nНехай співають всі Тобі: \\\"Слава, слава, слава, \\n  Eb                   Bb      \\nСлава, слава, слава Тобі!\\\"\\n\\n\\n\\n\\nПриспів:      \\n               Gm          Eb\\nТакий Великий Бог, а так близько...\\n         Bb               F  \\nТи так близько, в серці моїм!\\n                 Gm        Eb\\nХоч небо над землею так високо,\\n       Bb                F  \\nА Ти близько – в серці моїм,\\n               Gm  Eb  Bb   F\\nТакий Великий Бог!\\n\\n\\n\\n\\nКуплет 2.1:      \\n   Gm                       Cm\\nНехай хвала із наших уст буде Тобі приємна, \\n    Eb                         Bb         F\\nГосподь Один достойний слави, Ти Один Святий!\\n   Gm                     Cm\\nНехай у єдності серця співають: \\\"Слава, слава,\\n  Eb                   Bb      \\nСлава, слава, слава Тобі!\\\"\\n\\n\\nКуплет 2.2:\\n   Gm                     Cm\\nНехай у радості земля Спасителя чекає,\\n    Eb                         Bb            F\\nГосподь Один достойний слави, добрий тільки Ти!\\n   Gm                       Cm\\nНехай співають всі Тобі: \\\"Слава, слава, слава, \\n  Eb                   Bb      \\nСлава, слава, слава Тобі!\\\"\",\"new\":\"Куплет 1.1:      \\n   Gm                    Cm\\nНехай поклоняться Тобі всі народи, Бог мій, \\n    Eb                       Bb         F\\nБо Ти Один достойний слави, Ти Один Святий!\\n   Gm                       Cm\\nНехай співають всі Тобі: \\\"Слава, слава, слава, \\n  Eb                   Bb    F\\nСлава, слава, слава Тобі!\\\"\\n\\n\\nКуплет 1.2:\\n   Gm                       Cm\\nНехай молитви всі Тобі з подякою складають,\\n    Eb                       Bb            F\\nБо Ти Один достойний слави, добрий тільки Ти!\\n   Gm                       Cm\\nНехай співають всі Тобі: \\\"Слава, слава, слава, \\n  Eb                   Bb      \\nСлава, слава, слава Тобі!\\\"\\n\\n\\n\\n\\nПриспів:      \\n               Gm          Eb\\nТакий Великий Бог, а так близько...\\n         Bb               F  \\nТи так близько, в серці моїм!\\n                 Gm        Eb\\nХоч небо над землею так високо,\\n       Bb                F  \\nА Ти близько – в серці моїм,\\n               Gm  Eb  Bb   F\\nТакий Великий Бог!\\n\\n\\n\\n\\nКуплет 2.1:      \\n   Gm                       Cm\\nНехай хвала із наших уст буде Тобі приємна, \\n    Eb                         Bb         F\\nГосподь Один достойний слави, Ти Один Святий!\\n   Gm                     Cm\\nНехай у єдності серця співають: \\\"Слава, слава,\\n  Eb                   Bb      \\nСлава, слава, слава Тобі!\\\"\\n\\n\\nКуплет 2.2:\\n   Gm                     Cm\\nНехай у радості земля Спасителя чекає,\\n    Eb                         Bb            F\\nГосподь Один достойний слави, добрий тільки Ти!\\n   Gm                       Cm\\nНехай співають всі Тобі: \\\"Слава, слава, слава, \\n  Eb                   Bb      \\nСлава, слава, слава Тобі!\\\"\"}}', '{\"title\":\"Нехай поклоняться Тобі всі народи, Бог мій,\",\"title2\":\"Такий Великий Бог, а так близько...\",\"title_note\":\"\",\"song_text\":\"Куплет 1.1:      \\n   Gm                    Cm\\nНехай поклоняться Тобі всі народи, Бог мій, \\n    Eb                       Bb         F\\nБо Ти Один достойний слави, Ти Один Святий!\\n   Gm                       Cm\\nНехай співають всі Тобі: \\\"Слава, слава, слава, \\n  Eb                   Bb    F\\nСлава, слава, слава Тобі!\\\"\\n\\n\\nКуплет 1.2:\\n   Gm                       Cm\\nНехай молитви всі Тобі з подякою складають,\\n    Eb                       Bb            F\\nБо Ти Один достойний слави, добрий тільки Ти!\\n   Gm                       Cm\\nНехай співають всі Тобі: \\\"Слава, слава, слава, \\n  Eb                   Bb      \\nСлава, слава, слава Тобі!\\\"\\n\\n\\n\\n\\nПриспів:      \\n               Gm          Eb\\nТакий Великий Бог, а так близько...\\n         Bb               F  \\nТи так близько, в серці моїм!\\n                 Gm        Eb\\nХоч небо над землею так високо,\\n       Bb                F  \\nА Ти близько – в серці моїм,\\n               Gm  Eb  Bb   F\\nТакий Великий Бог!\\n\\n\\n\\n\\nКуплет 2.1:      \\n   Gm                       Cm\\nНехай хвала із наших уст буде Тобі приємна, \\n    Eb                         Bb         F\\nГосподь Один достойний слави, Ти Один Святий!\\n   Gm                     Cm\\nНехай у єдності серця співають: \\\"Слава, слава,\\n  Eb                   Bb      \\nСлава, слава, слава Тобі!\\\"\\n\\n\\nКуплет 2.2:\\n   Gm                     Cm\\nНехай у радості земля Спасителя чекає,\\n    Eb                         Bb            F\\nГосподь Один достойний слави, добрий тільки Ти!\\n   Gm                       Cm\\nНехай співають всі Тобі: \\\"Слава, слава, слава, \\n  Eb                   Bb      \\nСлава, слава, слава Тобі!\\\"\",\"notes\":\"\"}', '2026-05-28 00:56:40'),
(7, 8050, 82, 'updated', '{\"title\":{\"old\":\"Я проголошу Ім‘я Ісуса\",\"new\":\"Я проголошу Ім‘я Ісуса - font normal\"}}', '{\"title\":\"Я проголошу Ім‘я Ісуса - font normal\",\"title2\":\"Ім‘я могутнє\",\"title_note\":\"I speak Jesus\",\"song_text\":\"Інтро:  \\n|C   |C   |Am7  |Am7  |  \\n\\n\\n\\nКуплет 1:  \\nC\\nЯ проголошу Ім\'я Ісуса\\nAm\\nНад серцями й душами людей.\\nF\\nЦе Ім\'я звільняє й мир приносить.\\n         C\\nСкажу: Ісус.\\n\\n\\n\\nКуплет 2:  \\nC\\nЯ проголошу ім\'я Ісуса,\\nAm\\nЩоб спинити страх, залежність, гріх.\\nF\\nЄ життя, свобода і надія -    \\n         C\\nСкажу: Ісус.\\n\\n\\n\\nПриспів:  \\n        G\\nІм\'я могутнє,\\n   C\\/E  F\\nІм\'я велике,\\n         C\\nІм\'я святе.\\n           G\\nПітьму руйнує,\\n      C\\/E   F\\nВ темряві світить,\\n        C\\nЖиття дає.\\n\\n\\n\\nКуплет 3:  \\nC\\nЯ проголошу ім\'я Ісуса\\nAm\\nНад страхом і тривогами всіма\\nF\\nВ душі, що страждають від депресій - \\n         C\\nСкажу: Ісус.\\n\\n\\n\\nБридж:х3  \\nC\\nНа площах, на майданах нехай звучить Ім\'я.\\nAm\\nКрізь темряву й завади і в обличчя ворогам.\\nF\\nДля сім\'ї і для країни    \\n                     C\\nСкажу святе Ім\'я - ІСУС!\\n\\n\\n\\nКуплет 4:  \\nC\\nЯ проголошу Ім\'я Ісуса\\nAm\\nНад серцями й душами людей.\\nF\\nЦе Ім\'я звільняє й мир приносить.\\n         C\\nСкажу: Ісус.\",\"notes\":\"sergio +4 (en E)\"}', '2026-05-28 01:08:41');

--
-- Índices para tablas volcadas
--

--
-- Indices de la tabla `songs_versions`
--
ALTER TABLE `songs_versions`
  ADD PRIMARY KEY (`id_version`),
  ADD KEY `idx_song_created` (`id_song`,`created_at`),
  ADD KEY `idx_user_created` (`id_user`,`created_at`);

--
-- AUTO_INCREMENT de las tablas volcadas
--

--
-- AUTO_INCREMENT de la tabla `songs_versions`
--
ALTER TABLE `songs_versions`
  MODIFY `id_version` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
